# Koşullu Eleman İşlemleri

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2", "var3"])
df

   var1  var2  var3
0    23    10    11
1    12    27    12
2    29    18     6
3     6    10    22
4    22    27     5
5    11     2    19
6    22    23    18
7     5    26     9
8    13    20    22
9    18    27    23

In [2]:
df["var1"]

0    23
1    12
2    29
3     6
4    22
5    11
6    22
7     5
8    13
9    18
Name: var1, dtype: int32

In [3]:
df["var1"][0:2]

0    23
1    12
Name: var1, dtype: int32

In [4]:
df.var1

0    23
1    12
2    29
3     6
4    22
5    11
6    22
7     5
8    13
9    18
Name: var1, dtype: int32

In [5]:
df[df.var1 > 15]["var1"]

0    23
2    29
4    22
6    22
9    18
Name: var1, dtype: int32

In [6]:
df[(df.var1 > 15) & (df.var3 < 7)]

   var1  var2  var3
2    29    18     6
4    22    27     5

In [7]:
df.loc[(df.var1 > 15), ["var2","var3"]]

   var2  var3
0    10    11
2    18     6
4    27     5
6    23    18
9    27    23

In [8]:
#alternatif
df[(df.var1 > 15)][["var2","var3"]]

   var2  var3
0    10    11
2    18     6
4    27     5
6    23    18
9    27    23